## Pandas

- **Dataframe** :- Special Object to View Data in Tabular Form ( Rows & Columns )

In [1]:
import numpy as np
import pandas as pd

### Creating A Dataframe

In [2]:
user_data = {
    "MarksA": np.random.randint(1,100,5),
    "MarksB": np.random.randint(50,100,5),
    "MarksC": np.random.randint(1,100,5)
}
print(user_data)

{'MarksA': array([98, 54, 93, 90,  8]), 'MarksB': array([91, 94, 63, 98, 95]), 'MarksC': array([43, 69, 19, 42, 32])}

In [3]:
df = pd.DataFrame(user_data)
print(df)

   MarksA  MarksB  MarksC
0      98      91      43
1      54      94      69
2      93      63      19
3      90      98      42
4       8      95      32

In [4]:
df.head()

   MarksA  MarksB  MarksC
0      98      91      43
1      54      94      69
2      93      63      19
3      90      98      42
4       8      95      32

In [5]:
df.head(n=3)

   MarksA  MarksB  MarksC
0      98      91      43
1      54      94      69
2      93      63      19

In [6]:
print(df.columns)

Index(['MarksA', 'MarksB', 'MarksC'], dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   MarksA  5 non-null      int32
 1   MarksB  5 non-null      int32
 2   MarksC  5 non-null      int32
dtypes: int32(3)
memory usage: 188.0 bytes

In [8]:
df = pd.DataFrame(user_data, dtype='float32')
df.head()

   MarksA  MarksB  MarksC
0    98.0    91.0    43.0
1    54.0    94.0    69.0
2    93.0    63.0    19.0
3    90.0    98.0    42.0
4     8.0    95.0    32.0

In [9]:
df.to_csv("Marks.csv")

In [10]:
df_new = pd.read_csv("Marks.csv")
df_new.head()

   Unnamed: 0  MarksA  MarksB  MarksC
0           0    98.0    91.0    43.0
1           1    54.0    94.0    69.0
2           2    93.0    63.0    19.0
3           3    90.0    98.0    42.0
4           4     8.0    95.0    32.0

In [11]:
df_new = pd.read_csv("Marks.csv")
df_new = df_new.drop(columns=["Unnamed: 0"])
df_new.head()

   MarksA  MarksB  MarksC
0    98.0    91.0    43.0
1    54.0    94.0    69.0
2    93.0    63.0    19.0
3    90.0    98.0    42.0
4     8.0    95.0    32.0